In [2]:
##Importing the necessary packages
import pandas as pd #easy to use open source data analysis and manipulate data
import numpy as np #used for working with arrays.
import plotly.express as px # used for data visualization
import plotly.graph_objects as go

from connection import connect_to_db #importing the function to connect to the database
import warnings
warnings.filterwarnings('ignore')


pd.set_option('display.max_colwidth',None)
pd.set_option('display.max_columns',None)

Connected to database: adventureworks.db

### Sales & Revenue Analysis

1. What is the total sales generated?

In [7]:
# query for total sales
total_sales = """
    SELECT
        SUM(LineTotal) AS [Total Sales] 
    FROM SalesOrderDetail
"""

total_sales = pd.read_sql(total_sales,connect_to_db())
total_sales

Connected to database: adventureworks.db

    Total Sales
0  1.098464e+08

2. What is the total number of orders made?

In [8]:
total_orders = """
    SELECT 
        COUNT(OrderQty) AS [Total Orders]
    FROM SalesOrderDetail
"""

total_orders = pd.read_sql(total_orders,connect_to_db())
total_orders

Connected to database: adventureworks.db

   Total Orders
0        121317

3. Sales generated per a product

In [35]:
sales_product = """
    SELECT 
        p.Name AS [Product Name],
        SUM(LineTotal) AS Sales
    FROM SalesOrderDetail AS sod
    JOIN Product AS p
    ON sod.ProductID = p.ProductID
    GROUP BY p.Name
    ORDER BY Sales DESC
"""

sales_product = pd.read_sql(sales_product,connect_to_db())
sales_product

Connected to database: adventureworks.db

                      Product Name         Sales
0           Mountain-200 Black, 38  4.400593e+06
1           Mountain-200 Black, 42  4.009495e+06
2          Mountain-200 Silver, 38  3.693678e+06
3          Mountain-200 Silver, 42  3.438479e+06
4          Mountain-200 Silver, 46  3.434257e+06
..                             ...           ...
261         LL Touring Seat/Saddle  1.480752e+03
262  LL Mountain Frame - Black, 40  1.198992e+03
263    LL Touring Frame - Blue, 58  8.002080e+02
264         Mountain Bike Socks, L  5.130000e+02
265            LL Road Seat/Saddle  1.627200e+02

[266 rows x 2 columns]

4. What are the top 5 best-selling products by total quantity sold?

In [41]:
best_selling_product = """
    SELECT 
        p.Name AS [Product Name],
        SUM(sod.OrderQty) AS [TotalQuantitySold]
    FROM SalesOrderDetail AS sod
    JOIN Product AS p
    ON sod.ProductID = p.ProductID
    GROUP BY p.Name
    ORDER BY [TotalQuantitySold] DESC
    LIMIT 5
"""

best_selling_product = pd.read_sql(best_selling_product,connect_to_db())
best_selling_product

Connected to database: adventureworks.db

                 Product Name  TotalQuantitySold
0                AWC Logo Cap               8311
1       Water Bottle - 30 oz.               6815
2      Sport-100 Helmet, Blue               6743
3  Long-Sleeve Logo Jersey, L               6592
4     Sport-100 Helmet, Black               6532

5. What are the top 5 least-selling products by total quantity sold?

In [42]:
least_selling_product = """
    SELECT 
        p.Name AS [Product Name],
        COUNT(sod.OrderQty) AS [Most Ordered Product]
    FROM SalesOrderDetail AS sod
    JOIN Product AS p
    ON sod.ProductID = p.ProductID
    GROUP BY p.Name
    ORDER BY [Most Ordered Product] ASC
    LIMIT 5
"""

least_selling_product = pd.read_sql(least_selling_product,connect_to_db())
least_selling_product

Connected to database: adventureworks.db

                       Product Name  Most Ordered Product
0       LL Touring Frame - Blue, 58                     2
1  ML Mountain Frame-W - Silver, 38                     5
2     LL Mountain Frame - Black, 40                     6
3               LL Road Seat/Saddle                     6
4     LL Mountain Frame - Black, 52                     9

6. What is the total revenue per sales territory?

In [47]:
revenue_territory = """
    SELECT 
        st.Name AS [Territory Name],
        soh.TotalDue as [Total Revenue]
    FROM SalesOrderHeader AS soh
    JOIN SalesTerritory AS st
    ON soh.TerritoryID = st.TerritoryID
    GROUP BY st.Name
    ORDER BY [Total Revenue] DESC
"""

revenue_territory = pd.read_sql(revenue_territory,connect_to_db())
revenue_territory

Connected to database: adventureworks.db

   Territory Name  Total Revenue
0          Canada     36865.8012
1       Northwest     27510.4109
2       Southeast     23153.2339
3         Central      6876.3649
4       Northeast      4216.0258
5         Germany      3953.9884
6          France      3756.9890
7       Australia      3756.9890
8  United Kingdom       772.5036
9       Southwest       472.3108

### Customer

1. Who are the top 5 customers by total purchases?

In [50]:
customer = """
    SELECT
        c.CustomerID,
        SUM(soh.TotalDue) [Total Purchases]
    FROM Customer AS c
    JOIN SalesOrderHeader AS soh
    ON c.CustomerID = soh.CustomerID
    GROUP BY c.CustomerID
    ORDER BY [Total Purchases] DESC
    LIMIT 5
"""
customer = pd.read_sql(customer,connect_to_db())
customer

Connected to database: adventureworks.db

   CustomerID  Total Purchases
0       29818     1.978368e+06
1       29715     1.923352e+06
2       29722     1.908044e+06
3       30117     1.839604e+06
4       29614     1.802694e+06

2. What is the total number of orders per customer?

In [52]:
order_per_customer = """
    SELECT 
        c.CustomerID,
        COUNT(soh.SalesOrderID) AS [Total Orders]
    FROM Customer c
    JOIN SalesOrderHeader soh
    ON c.CustomerID = soh.CustomerID
    GROUP BY c.CustomerID
    ORDER BY [Total Orders] DESC
    LIMIT 10
 """
order_per_customer = pd.read_sql(order_per_customer,connect_to_db())
order_per_customer

Connected to database: adventureworks.db

   CustomerID  Total Orders
0       11176            56
1       11091            56
2       11711            54
3       11331            54
4       11330            54
5       11300            54
6       11287            54
7       11277            54
8       11276            54
9       11262            54

3. Which territory has the most customers?

In [58]:
territory_customers = """
    SELECT 
        st.Name AS [Territory Name], 
        COUNT(c.CustomerID) AS [Number of Customers]
    FROM Customer c
    JOIN SalesTerritory st 
    ON c.TerritoryID = st.TerritoryID
    GROUP BY st.Name
    ORDER BY [Number of Customers] DESC
"""
territory_customers = pd.read_sql(territory_customers,connect_to_db())
territory_customers

Connected to database: adventureworks.db

   Territory Name  Number of Customers
0       Southwest                 4696
1       Australia                 3665
2       Northwest                 3520
3  United Kingdom                 1991
4          France                 1884
5         Germany                 1852
6          Canada                 1791
7       Southeast                  176
8         Central                  132
9       Northeast                  113

### Production

1. Which product has the highest average unit price sold?

In [59]:
highest_average = """
    SELECT 
        p.Name AS [Product Name],
        AVG(sod.UnitPrice) AS [Average Unit Price]
    FROM SalesOrderDetail sod
    JOIN Product p 
    ON sod.ProductID = p.ProductID
    GROUP BY p.Name
    ORDER BY [Average Unit Price] DESC
    LIMIT 10
"""

highest_average = pd.read_sql(highest_average,connect_to_db())
highest_average

Connected to database: adventureworks.db

              Product Name  Average Unit Price
0         Road-150 Red, 48         3326.303800
1         Road-150 Red, 52         3290.493788
2         Road-150 Red, 44         3270.418838
3         Road-150 Red, 62         3170.194953
4         Road-150 Red, 56         3035.879600
5   Mountain-100 Black, 44         2290.809328
6  Mountain-100 Silver, 38         2273.478790
7   Mountain-100 Black, 48         2244.437794
8  Mountain-100 Silver, 44         2228.379712
9   Mountain-100 Black, 38         2221.003035